/*
Моя погодинна ставка 80$ також я згодна працювати не більше 5 годин в тиждень (окрім вихідних).
Мені запропонували виконати замовлення на 40 робочих годин.
Сьогодні понеділок.
Я маю поїхати через 11 днів.
Вивести в консоль:
- Boolean змінну чи встигну я взятися за дане замовлення.
- Яка вартість замовлення?
*/

// Дані
const payRateUSD = 80;
const projectHours = 40;
const availableHours = (11 - 2) * 5;

// Результат
console.log('Чи зможу я працювати?' + (availableHours > projectHours));
console.log('Вартість замовлення:' + projectHours * payRateUSD + '$');
