/*тут я трохи забігла наперед виявляється, просто повторила приклад та хотіла запитати тебе, шо тут відбувається)*/

switch (new Date().getDay()){
    case 6:
        console.log('сьогодні субота');
        break;
    case 0:
        console.log('сьогодні неділя');
        break;
    default:
        console.log('з нетерпінням чекаю вихідних');
}

const date = new Date();
console.log(date);//отримати поточний час

/*оце методи, я вражена! я спочатку не зрозуміла як то, бо ще не вивчала дати,побачила на прикладі switch та й думаю "як то працює")*/ 